// SPDX-License-Identifier: AGPL-3.0-or-later
#include "common.h"
/*__SEEDEXTERNS__*/
extern f32 D_selection_0041F4EC;
extern f32 D_selection_0041F4F0;
extern f32 D_selection_00420E20;
typedef struct {
    /* 0x00 */ char pad0[0xF8];
    /* 0xF8 */ f32 unkF8;
    /* 0xFC */ Mtx4F unkFC;
    /* 0x13C */ char pad13C[0x6C];
    /* 0x1A8 */ Mtx4F unk1A8;
} ObjNode_4168C4;
typedef struct {
    /* 0x00 */ char pad00[0x0C];
    /* 0x0C */ void (*unk0C)(Mtx4F *, Mtx4F *);
    /* 0x10 */ char pad10[0x18];
    /* 0x28 */ void (*unk28)(Mtx4F *, f32, s8);
    /* 0x2C */ void (*unk2C)(Mtx4F *, f32, f32, f32);
} UvFMtxExp_4168C4;
extern UvFMtxExp_4168C4 *gUvFmtxExports;
typedef struct {
    char pad[0x40];
    void (*unk40)(s32, s32, s32, s32, s32, s32, s32, s32, s32);
} SelPrinter_00411038;
typedef struct {
    void (*unk0)(void);
    void (*unk4)(s32);
    char pad8[0x14];
    s32 (*unk1C)(void);
    char pad20[0x8];
    void (*unk28)(void);
} UvFontExp_00411038;
extern UvFontExp_00411038 *gUvFontExports;
extern s32 D_selection_00421CE8;
extern s32 D_selection_00421E98;
extern s32 D_selection_00421E9C;
typedef struct {
    char pad0[0x3C];
    s32 (*unk3C)(u16, s32);
    char pad40[0x4];
    s32 (*unk44)(s32, s32, s32);
} UvContExp_413418;
extern s32 D_selection_00420E4C;
extern void func_selection_00411B9C(void);
typedef struct { char pad[0x74]; void (*unk74)(void); } UvGfxMgrExp_BEC8;
typedef struct { char pad[0x8]; void (*unk8)(void); } UvTexAnimExp_BEC8;
extern s16 D_selection_00420D24[];
extern s16 D_selection_00420D3C[];
extern s16 D_selection_00420D48[];
extern s32 D_selection_00420E04;
extern s16 D_selection_00420D6C;
extern s16 D_selection_00420D7E;
extern s16 D_selection_00421E3A;
extern s16 D_selection_00421E3C;
typedef struct { /* 0x00 */ char pad0[4]; /* 0x04 */ s16 unk4; /* 0x06 */ char pad6[0xE]; } InnerItem_0041B19C;
typedef struct { /* 0x00 */ char pad0[4]; /* 0x04 */ s16 unk4; /* 0x06 */ char pad6[2]; /* 0x08 */ InnerItem_0041B19C *unk8; } InnerObj_0041B19C;
typedef struct { /* 0x00 */ char pad0[8]; /* 0x08 */ InnerObj_0041B19C *unk8; } D1CTarget_0041B19C;
typedef struct { /* 0x00 */ char pad0[4]; /* 0x04 */ void (*unk4)(void *, s32, InnerObj_0041B19C *); /* 0x08 */ s32 (*unk8)(s32, InnerObj_0041B19C *); } ContExp_0041B19C;
typedef struct { char pad[0x74]; void (*unk74)(void); } UvGfxMgrExp_sel_0041A0CC;
typedef struct {
    char pad0[0x3C];
    void (*unk3C)(u16, s32);
    char pad40[0x4];
    s32  (*unk44)(s32, s32, s32);
} UvContExp_00419AA4;
extern void func_selection_00419084(void);
extern void func_selection_00419B9C(void);
extern s32 D_8002CC8C;
extern s16 D_selection_00421BA4;
extern s16 D_selection_00421E34;
extern s16 D_selection_00421E36;
typedef struct {
    /* 0x00 */ char pad00[0x0C];
    /* 0x0C */ void (*unkC)(s32);
    /* 0x10 */ void (*unk10)(s32);
    /* 0x14 */ char pad14[0x3C];
    /* 0x50 */ void (*unk50)(void);
    /* 0x54 */ void (*unk54)(void);
} GfxStateExp_00416D94;
typedef struct {
    /* 0x00 */ char pad00[0x10];
    /* 0x10 */ void (*unk10)(s32);
    /* 0x14 */ char pad14[0x08];
    /* 0x1C */ void (*unk1C)(s32, s32, s32, s32, s32, s32, s32, s32);
} SprtExp_00416D94;
typedef struct {
    char pad0[0x4];
    s16 (*unk4)(void);
    char pad8[0xC];
    s16 (*unk14)(s32);
    s16 (*unk18)(s32);
    void (*unk1C)(s32, ...);
} UvSprtFull_0040F0F8;
extern s32 D_selection_00421CE4;
extern void func_selection_00415EF4(void);
extern void func_selection_004017E0(void);
extern void func_selection_00415A34(s32);
extern void func_selection_00415C78(void);
extern s16 D_selection_00421E24;
typedef struct {
    char pad00[0x34];
    void (*unk34)(s32);
    void (*unk38)(s32);
    void (*unk3C)(s32);
    char pad3C[0xA0];
    void (*unkE0)(s32);
} SndExp_409FC8;
typedef struct {
    char pad00[0x2C];
    void (*unk2C)(void);
} UvCMidiExp_409FC8;
extern UvCMidiExp_409FC8 *gUvCmidiExports;
typedef struct UnkSelectionObj_004158DC_s {
    /* 0x000 */ s16 unk0;
    /* 0x002 */ u8 pad2[0x220 - 0x2];
    /* 0x220 */ s32 unk220;
} UnkSelectionObj_004158DC;
typedef struct CamExp_004158DC_s {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ void (*unk20)(void *, s32, f64, s32);
} CamExp_004158DC;
typedef struct UvGfxMgrExp_004158DC_s {
    /* 0x00 */ char pad0[0x74];
    /* 0x74 */ void (*unk74)(void);
} UvGfxMgrExp_004158DC;
typedef struct UvTexAnimExp_004158DC_s {
    /* 0x00 */ char pad0[0x8];
    /* 0x08 */ void (*unk8)(void);
} UvTexAnimExp_004158DC;
typedef struct UvTerraExp_004158DC_s {
    /* 0x00 */ char pad0[0x8];
    /* 0x08 */ void (*unk8)(s16, s32);
} UvTerraExp_004158DC;
typedef struct UvEnvExp_004158DC_s {
    /* 0x00 */ char pad0[0x18];
    /* 0x18 */ void (*unk18)(s16, s32);
} UvEnvExp_004158DC;
extern f32 D_selection_0041F4C4;
extern CamExp_004158DC *gCamExports;
extern s32 D_selection_00421E84;
extern s32 D_selection_00421E88;
extern s32 D_selection_00421E8C;
extern s32 D_selection_00421E94;
typedef struct {
    char pad0[0xC];
    void (*unkC)(f32, f32, f32, f32);
    void (*unk10)(s32, s32, s32, s32);
} UvGeomExp_00410D20;
extern UvGeomExp_00410D20 *gUvGeomExports;
typedef struct {
    /* 0x00 */ s32 unk0;
    /* 0x04 */ s32 unk4;
    /* 0x08 */ s32 unk8;
    /* 0x0C */ s32 unkC;
} Node_0040D8B4;
extern s32 D_8002CCB0;
extern s32 D_8002CCB4;
extern s32 D_8002CCB8;
extern Node_0040D8B4 D_8002CCBC;
typedef struct { char pad[0x74]; void (*unk74)(void); } UvGfxMgrExp_0040C96C;
typedef struct { char pad[0x8]; void (*unk8)(void); } UvTexAnimExp_0040C96C;
typedef struct { /* 0x000 */ s16 unk0; /* 0x002 */ char pad2[0x21E]; /* 0x220 */ s32 unk220; } Node_0040C96C;
typedef struct { char pad[0x8]; void (*unk8)(s16, s32); } UvTerraExp_0040C96C;
typedef struct { char pad[0x18]; void (*unk18)(s16, s32); } UvEnvExp_0040C96C;
extern s32 D_selection_00420E68;
typedef struct {
    /* 0x00 */ s32 unk0;
    /* 0x04 */ s16 unk4;
    /* 0x06 */ u8  pad6[0x14 - 0x6];
} Node_0040D98C;
typedef struct {
    /* 0x00 */ s32          unk0;
    /* 0x04 */ s16          unk4;
    /* 0x06 */ u8           pad6[0x8 - 0x6];
    /* 0x08 */ Node_0040D98C *unk8;
} Inner_0040D98C;
typedef struct {
    /* 0x00 */ u8           pad0[0x8];
    /* 0x08 */ Inner_0040D98C *unk8;
} Outer_0040D98C;
void func_selection_00401FB0(void);
void func_selection_00404888(void);
void func_selection_004048D8(void);
extern s16 D_selection_00421E38;
typedef struct {
    /* 0x00 */ char pad[0x8];
    /* 0x08 */ s32 (*unk8)(s32, s32);
} Ctrl_0040CA50;
typedef struct {
    /* 0x00 */ char pad[0x8];
    /* 0x08 */ s32 unk8;
} Data_0040CA50;
extern void func_selection_00401964(s32 *, s32, s32);
extern void func_selection_004039B0(void);
extern s8 D_selection_00421CF0;
typedef struct {
    char pad0[0xC];
    void (*unk0C)(s32);
    void (*unk10)(s32);
    char pad14[0x3C];
    void (*unk50)(void);
    void (*unk54)(void);
} UvGfxStateExp_0040626C;
extern UvGfxStateExp_0040626C *gUvGfxStateExports;
typedef struct { char pad[0x10]; void (*unk10)(s16); } UvSprtLocal_0040626C;
extern s32 gOptionsSfxVol;
typedef struct {
    char pad0[0x34];
    void (*unk34)(s32 *, s32, s32, s32, void *);
} UnkStruct_00421B90_00403C2C;
typedef struct {
    char pad0[0x44];
    void (*unk44)(s32);
    char pad48[0x98];
    void (*unkE0)(s32);
    char padE4[0x10];
    void (*unkF4)(s32);
} UnkSndExports_00403C2C;
extern s32 gOptionsSpeechVol;
typedef struct UnkContExports_004030E4_s {
    /* 0x00 */ char pad0[0x8];
    /* 0x08 */ s32 (*unk8)(s32);
} UnkContExports_004030E4;
extern void func_selection_00415CA0(s32);
extern void func_selection_00419038(void);
extern s32 D_8002CC64;
extern s32 D_8002CD54;
extern s32 D_8002CD58;
extern s32 D_8002CD5C;
extern s32 D_8002CD60;
extern s32 D_8002CD64;
extern s32 D_8002CD68;
extern s32 D_8002CD6C;
extern s32 D_8002CD70;
extern s32 D_selection_0041FF9C;
typedef struct UnkSelectionObj_s {
    /* 0x000 */ s16 unk0;
    /* 0x002 */ u8 pad2[0x220 - 0x2];
    /* 0x220 */ s32 unk220;
} UnkSelectionObj;
typedef struct UvGfxMgrExp_0040372C_s {
    /* 0x00 */ char pad0[0x74];
    /* 0x74 */ void (*unk74)(void);
} UvGfxMgrExp_0040372C;
typedef struct UvTexAnim_Exports_s {
    /* 0x00 */ char pad0[0x8];
    /* 0x08 */ void (*unk8)(void);
} UvTexAnim_Exports;
typedef struct UvTerra_Exports_s {
    /* 0x00 */ char pad0[0x8];
    /* 0x08 */ void (*unk8)(s16, s32);
} UvTerra_Exports;
typedef struct UvEnv_Exports_s {
    /* 0x00 */ char pad0[0x18];
    /* 0x18 */ void (*unk18)(s16, s32);
} UvEnv_Exports;
extern void func_selection_00416A50(s32, s32);
extern UnkSelectionObj **D_selection_00421D18;
extern UvGfxMgrExp_0040372C *gUvGfxMgrExports;
extern UvTexAnim_Exports *gUvTexAnimExports;
extern UvTerra_Exports *gUvTerraExports;
extern UvEnv_Exports *gUvEnvExports;
extern s32 D_selection_00421E40;
typedef struct UnkContExports_s {
    /* 0x00 */ char pad0[0x5C];
    /* 0x5C */ void (*unk5C)(s32, s32);
} UnkContExports;
extern UnkContExports *gUvContExports;
typedef struct UvString_Exports4_s {
    char pad0[0x10];
    void (*unk10)(char *, char *, s32, s32);
} UvString_Exports4;
typedef struct D_selection_004217C8_entry_s {
    s32 unk0;
    s32 unk4;
    char pad8[0x2C - 0x8];
} D_selection_004217C8_entry;
extern UvString_Exports4 *gUvStringExports;
extern D_selection_004217C8_entry D_selection_004217C8[];
extern char D_selection_0041EEA0[];
void func_selection_00410E78(s32, s32, char *);
typedef struct {
    s32 text;
    s8  pad[0x28];
} SelectionLangEntry; /* sizeof == 0x2C */

extern SelectionLangEntry D_selection_004217F0[];
extern s32 gOptionsLanguage;
typedef struct UvSprt_Exports_s {
    char pad0[0x8];
    void (*unk8)(s16);
} UvSprt_Exports;
void func_selection_00404888(void);
typedef struct {
    char pad0[0xE0];
    void (*unkE0)(s32);
} SndExports_sel3D24;
typedef struct {
    char pad0[0x3C];
    void (*unk3C)(s32);
} SndExports_sel3D24b;
typedef struct {
    char pad0[0x34];
    void (*unk34)(s32 *, s32, s32, s32, s32);
} SelectionCtrl3D24;
extern SelectionCtrl3D24 *D_selection_00421B90;
extern s32 gOptionsMusicVol;
extern void func_selection_00415D48(s32);
extern s32 D_selection_0041FC38;
typedef struct SelLeaf_s {
    /* 0x00 */ s16 unk0;
    /* 0x02 */ s16 unk2;
    /* 0x04 */ char pad4[0x12];
    /* 0x16 */ s16 unk16;
} SelLeaf;
typedef struct SelNodeData_s {
    /* 0x00 */ s32 unk0;
    /* 0x04 */ s32 unk4;
    /* 0x08 */ SelLeaf *unk8;
} SelNodeData;
typedef struct SelNode_s {
    /* 0x00 */ s32 unk0;
    /* 0x04 */ struct SelNode_s *unk4;
    /* 0x08 */ SelNodeData *unk8;
} SelNode;
void func_selection_00415CA0(s32);
extern SelNode D_selection_0041FBB4;
extern SelNode D_selection_0041FCF0;
typedef struct {
    char pad0[0xE0];
    void (*unkE0)(s32);
} SndExports_sel2E98;
typedef struct SelectionState2E98_s {
    char pad0[0x14];
    s16 unk14;
} SelectionState2E98;
extern SelectionState2E98 D_selection_0041F808;
extern void (*D_selection_00420F18[])(void);
extern SelectionState2E98 *D_selection_00421D20;
extern s32 D_selection_00421240[];
extern s16 D_selection_00421E08;
extern s32 D_selection_00420E24;
extern s32 D_selection_004201BC;
extern s32 D_selection_00421768;
extern s32 D_selection_0042176C[];
extern s8 D_selection_00421CF3;
extern s8 D_selection_00421CFB;
extern s8 D_selection_00421D03;
extern s8 D_selection_00421D0B;
extern s8 D_selection_00421DF4;
extern s8 D_selection_00421DF5;
extern s8 D_selection_00421DF6;
extern s8 D_selection_00421DF7;
