// SPDX-License-Identifier: AGPL-3.0-or-later
#include "common.h"
#include "module.h"
#include "stdarg.h"

typedef struct Emitter_s {
    /* 0x00 */ Vec3F unk0;
    /* 0x0C */ f32 unkC;
    /* 0x10 */ f32 unk10;
    /* 0x14 */ f32 unk14;
    /* 0x18 */ f32 unk18;
    /* 0x1C */ f32 unk1C;
    /* 0x20 */ f32 unk20;
    /* 0x24 */ Vec3F unk24;
    /* 0x30 */ f32 unk30;
    /* 0x34 */ s32 unk34;
    /* 0x38 */ u8 unk38;
    /* 0x39 */ char pad39[7]; /* maybe part of unk38[8]? */
    /* 0x40 */ f64 unk40;
    /* 0x48 */ Vec3F unk48;
    /* 0x54 */ f32 unk54;
    /* 0x58 */ s32 unk58;
    /* 0x5C */ f32 unk5C;
    /* 0x60 */ f32 unk60;
    /* 0x64 */ s32 unk64;
    /* 0x68 */ f32 unk68;
    /* 0x6C */ f32 unk6C;
    /* 0x70 */ f32 unk70;
    /* 0x74 */ f32 unk74;
    /* 0x78 */ s32 unk78;
    /* 0x7C */ s32 unk7C;
    /* 0x80 */ u8 unk80;
    /* 0x81 */ u8 unk81;
    /* 0x82 */ s8 unk82;
    /* 0x83 */ u8 unk83;
    /* 0x84 */ s32 unk84; /* inferred */
    u8 unk88;
} Emitter; /* size = 0x88 */

typedef struct EmitterSettings_s {
    /* 0x00 */ u16 unk0; /* inferred */
    /* 0x02 */ u16 unk2; /* inferred */
    /* 0x04 */ u16 unk4; /* inferred */
    /* 0x06 */ char pad6[2];
    /* 0x08 */ u32 unk8;   /* inferred */
    /* 0x0C */ void *unkC; /* inferred */
} EmitterSettings;         /* size = 0x10 */

extern EmitterSettings *D_uvemitter_rom_00402BF4;

void func_uvemitter_rom_00400578(void);
void func_uvemitter_rom_00400630(Emitter *obj);
s32 func_uvemitter_rom_004006FC(void);
void func_uvemitter_rom_0040075C(u8 arg0);
void func_uvemitter_rom_004007B4(u8 arg0, u8 arg1);
u8 func_uvemitter_rom_00400834(u8 arg0);
void func_uvemitter_rom_0040087C(u8 arg0, Vec3F *arg1);
void func_uvemitter_rom_004008CC(u8 arg0, UnkStruct_uvemitter_rom_004008CC *arg1);
void func_uvemitter_rom_00400920(u8 arg0, Vec3F *arg1);
void func_uvemitter_rom_00400970(u8 arg0, Unkstruct_uvemitter_rom_00400970 *arg1);
void func_uvemitter_rom_00400A0C(u8 arg0, Vec3F arg1);
void func_uvemitter_rom_00400A7C(u8 arg0, Vec3F *arg1);
void func_uvemitter_rom_00400ACC(u8 arg0, Vec3F arg1, Vec3F arg4);
void func_uvemitter_rom_00400BE8(u8 arg0, f32 arg1);
f32 func_uvemitter_rom_00400C5C(u8 arg0);
