// SPDX-License-Identifier: AGPL-3.0-or-later
#include "common.h"
#include "module.h"
#include "stdarg.h"
#include <PR/sp.h>
#include "uvasset_types.h"

#define MY_K0 (175 & 0x1ff)
#define MY_K1 (-43 & 0x1ff)
#define MY_K2 (-89 & 0x1ff)
#define MY_K3 (222 & 0x1ff)
#define MY_K4 (114 & 0x1ff)
#define MY_K5 (42 & 0x1ff)
#define SPRITE_SURF G_RM_TEX_EDGE
#define SPRITE_SURF2 G_RM_TEX_EDGE2

typedef struct uvSprite_s {
    /* 00 */ u8 unk0; // Flag to draw the sprite
    /* 01 */ u8 unk1;
    /* 02 */ u8 unk2; // Another flag to draw the sprite?
    /* 04 */ s16 height;
    /* 06 */ s16 unk6;
    /* 08 */ u16 textureId;
    /* 0A */ u16 unkA;
    /* 0xC */ Bitmap *bitmap;
    /* 10 */ Sprite sprite;
} uvSprite_t; // size 0x54

typedef struct UnkStruct_uvsprt_rom_004033CC_s {
    char pad[0x58];
    s32 (*unk58)(void);
} UnkStruct_uvsprt_rom_004033CC;

void __entrypoint_func_uvsprt_rom_400298(UvSprt_Rom_Exports* exports);
void uvSpriteFromBitmap(uvSprite_t *sprite, ParsedUVTX *uvtx);
void func_uvsprt_rom_004000A4(uvSprite_t *sprite, ParsedUVTX *uvtx);
s32 func_uvsprt_rom_004001EC(void);
void func_uvsprt_rom_0040023C(s32 arg0);
void uvModuleCleanup(void);
void uvSpriteDisplayList(Gfx **gdlh, uvSprite_t *sp);
void uvSpriteDrawAll(void);
void uvSpriteRender(s32 arg0);
void uvSpriteSetBlit(uvSprite_t *sprite, s32 blitId);
s16 uvGetSpriteWidth(s32 arg0);
s16 uvGetSpriteHeight(s32 arg0);
void uvSprtProps(s32 arg0, ...);
void uvDrawBitmap(Gfx **gdl, Sprite *s, Bitmap *b, s32 x, s32 y, s32 xx, s32 yy, s32 fs,
                              s32 ft, s32 sx, s32 sy);
void uvSpriteDrawInit(Gfx **glistp);
Gfx* uvSpriteDraw(Sprite* sp);
